
面试题 08.11. 硬币

硬币。给定数量不限的硬币，币值为25分、10分、5分和1分，编写代码计算n分有几种表示法。(结果可能会很大，你需要将结果模上1000000007)

示例1:

 输入: n = 5
 输出：2
 解释: 有两种方式可以凑成总金额:
5=5
5=1+1+1+1+1
示例2:

 输入: n = 10
 输出：4
 解释: 有四种方式可以凑成总金额:
10=10
10=5+5
10=5+1+1+1+1+1
10=1+1+1+1+1+1+1+1+1+1
说明：

注意:

你可以假设：

0 <= n (总金额) <= 1000000


//全局背包问题 见3.2.1487取硬币
class Solution {
public:
    int d[5]={0,1,5,10,25};

    int waysToChange(int n) {
        int f[5][n+1];
        memset(f,0,sizeof f);
        for(int i=1;i<=4;i++)
            f[i][0]=1;
        for(int i=1;i<=4;i++){
            for(int j=1;j<=n;j++){
                f[i][j]=f[i-1][j];
                if(j>=d[i])f[i][j]=(f[i][j]+f[i][j-d[i]])%1000000007;
            }
        }
        return f[4][n];
    }
};